Documents/ПоступлениеТоваровИУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>ПоступлениеТоваровИУслуг</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.Взаиморасчеты</xr:Item>
				<xr:Item>AccumulationRegister.СтоимостьМатериалов</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиМатериалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВхНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВхДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабНоменклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборСвойств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПоступлениеТоваровИУслуг/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПересчетТЧ(Элемент)
	РаботаСДокументами.РассчитатьСумму(Элементы.ТабНоменклатура.ТекущиеДанные);
КонецПроцедуры

// -------------------------------------------------

&НаКлиенте
Процедура ТабНоменклатураПриИзменении(Элемент)
	Объект.СуммаДокумента = Объект.ТабНоменклатура.Итог("Сумма");
	СуммаДокументаПрописью = РаботаСДокументами.ИтоговоеЧислоПрописью(Объект.СуммаДокумента);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СуммаДокументаПрописью = РаботаСДокументами.ИтоговоеЧислоПрописью(Объект.СуммаДокумента);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Объект.Договор = АвтозаполнениеРеквизитов.УстановитьОсновнойДоговорКонтрагента(Объект.Контрагент);
	
	ОчиститьСообщения();
	АвтозаполнениеРеквизитов.ПроверкаКонтрагента(1, Объект.Контрагент);
КонецПроцедуры

&НаКлиенте
Процедура ТабНоменклатураНоменклатураПриИзменении(Элемент)
	РаботаСДокументами.ОчиститьСтрокуТЧ(Элементы.ТабНоменклатура.ТекущиеДанные);
	
	СтрокаТЧ = Элементы.ТабНоменклатура.ТекущиеДанные;
	Тов = СтрокаТЧ.Номенклатура;
	СтрокаТЧ.ЕдиницаИзмерения = РаботаСоСправочниками.ПолучитьЕИ(Тов);
	СтрокаТЧ.ВидНоменклатуры = РаботаСоСправочниками.ПолучитьВидНоменклатуры(Тов);
	
	Объект.СуммаДокумента = Объект.ТабНоменклатура.Итог("Сумма");
	СуммаДокументаПрописью = РаботаСДокументами.ИтоговоеЧислоПрописью(Объект.СуммаДокумента);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТЧ(Команда)
	
	перем Отказ;
	
	Вопросы.ЗадатьВопросПользователю(Отказ); 
	
	//Если НЕ Отказ Тогда
	//	Объект.ТабНоменклатура.Очистить();
	//	Объект.СуммаДокумента = Объект.ТабНоменклатура.Итог("Сумма"); 
	//	
	//	//Можно написать и так:
	//	//Объект.СуммаДокумента = 0;
	//	
	//	СуммаДокументаПрописью = РаботаСДокументами.ИтоговоеЧислоПрописью(Объект.СуммаДокумента);
	//КонецЕсли;
		
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Объект.ТабНоменклатура.Очистить();
	Объект.СуммаДокумента = Объект.ТабНоменклатура.Итог("Сумма"); 
	
	//Можно написать и так:
	//Объект.СуммаДокумента = 0;
	
	СуммаДокументаПрописью = РаботаСДокументами.ИтоговоеЧислоПрописью(Объект.СуммаДокумента);
		
КонецПроцедуры

&НаКлиенте
Процедура СвернутьТЧ(Команда)
	перем Отказ;
	
	Вопросы.ЗадатьВопросПользователю(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	СвернутьТЧНаСервере(); 
	
КонецПроцедуры


&НаСервере
Процедура СвернутьТЧНаСервере()
	ТЗ = Объект.ТабНоменклатура.Выгрузить();
	//Сообщить(ТипЗнч(ТЗ)); 
	
	//Удаляем дубли
	//ТЗ.Свернуть("Номенклатура, Количество, Цена, Сумма");
	//Объект.СуммаДокумента = Объект.ТабНоменклатура.Итог("Сумма");
		
	//Складываем дубли 
	//ТЗ.Свернуть("Номенклатура, Цена", "Количество, Сумма");
	//ТЗ.Свернуть("Номенклатура, Цена, ЕдиницаИзмерения, ВидНоменклатуры", "Количество, Сумма");
	
	ТЗ.Свернуть("Номенклатура, Цена, ЕдиницаИзмерения, ВидНоменклатуры, НаборСвойств", "Количество, Сумма");  
	
	
	Объект.ТабНоменклатура.Загрузить(ТЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Объект.СуммаДокумента = Объект.ТабНоменклатура.Итог("Сумма"); 	
	СуммаДокументаПрописью = РаботаСДокументами.ИтоговоеЧислоПрописью(Объект.СуммаДокумента);
КонецПроцедуры
